class TestData {
  static const String ques='“给定资料1”中说“夜色难免黑凉，前行必有曙光”，“给定资料2”中说“我们的改革之所以成功，离不开务实的精神和理性的思考”。请深入理解这两句话的含义，参考给定资料，联系实际，自拟题目，写一篇文章。（35分）要求：（1）观点明确，见解深刻；（2）参考“给定资料”，但不拘泥于“给定资料”；（3）思路清晰，语言流畅；（4）字数1000～1200字。';
  static const String idea='这篇国考大作文题在题目中给出主要信息是“夜色难免黑凉，前行必有曙光”和“我们的改革之所以成功，离不开务实的精神和理性的思考”。第一句话比较泛，而第二句话提到了改革，说明出题人是要我们往“改革”上靠，那么文章主题就是改革。除此之外，题目还很直接地给出了三个重要信息“夜色难免黑凉，前行必有曙光”，“务实精神”和“理性思考”，属于题目直接给出了分论点的类型。“夜色难免黑凉，前行必有曙光”，我想到的就是理想信念，只要信念坚定，就能看见黑暗中透出来的光；“务实精神”就是要真抓实干、求真务实，或者实事求是，我觉得也可以；“理性思考”，我第一反应就是什么是理性思考，或者如何才能理性思考，这里我想到的就是要坚持问题导向。';
  static const String ans='点亮“理想信念”之灯，筑牢改革之魂。理想信念就是共产党人精神上的“钙”。纵观历史，从林则徐的“苟利国家生死以，岂因祸福避趋之”，到谭嗣同的“我自横刀向天笑，去留肝胆两昆仑”，再到周恩来总理的“为中华之崛起而读书”，无不彰显着先辈们坚定的信念之光。在改革发展的漫漫征途中，伟大成就离不开平凡岗位上的默默坚守，离不开艰难任务前的挺身而出。以信仰为指引，坚守才有动力，拼搏才有方向。坚定理想信念，就要想明白“我是谁、为了谁、依靠谁”，就要弄清楚“为谁干、干什么、怎么干”。唯此，才能在深化改革的复杂形势中不迷航，在艰巨斗争中不退缩，在攻坚克难中把党和人民的事业推向新境界。';
  //static const String ans='hudsig';
}