class TestData {
  static const String quesDetail='“给定资料1”中说“夜色难免黑凉，前行必有曙光”，“给定资料2”中说“我们的改革之所以成功，离不开务实的精神和理性的思考”。请深入理解这两句话的含义，参考给定资料，联系实际，自拟题目，写一篇文章。（35分）要求：（1）观点明确，见解深刻；（2）参考“给定资料”，但不拘泥于“给定资料”；（3）思路清晰，语言流畅；（4）字数1000～1200字。';
  static const String idea='这篇国考大作文题在题目中给出主要信息是“夜色难免黑凉，前行必有曙光”和“我们的改革之所以成功，离不开务实的精神和理性的思考”。第一句话比较泛，而第二句话提到了改革，说明出题人是要我们往“改革”上靠，那么文章主题就是改革。除此之外，题目还很直接地给出了三个重要信息“夜色难免黑凉，前行必有曙光”，“务实精神”和“理性思考”，属于题目直接给出了分论点的类型。“夜色难免黑凉，前行必有曙光”，我想到的就是理想信念，只要信念坚定，就能看见黑暗中透出来的光；“务实精神”就是要真抓实干、求真务实，或者实事求是，我觉得也可以；“理性思考”，我第一反应就是什么是理性思考，或者如何才能理性思考，这里我想到的就是要坚持问题导向。';
  static const String ans='点亮“理想信念”之灯，筑牢改革之魂。理想信念就是共产党人精神上的“钙”。纵观历史，从林则徐的“苟利国家生死以，岂因祸福避趋之”，到谭嗣同的“我自横刀向天笑，去留肝胆两昆仑”，再到周恩来总理的“为中华之崛起而读书”，无不彰显着先辈们坚定的信念之光。在改革发展的漫漫征途中，伟大成就离不开平凡岗位上的默默坚守，离不开艰难任务前的挺身而出。以信仰为指引，坚守才有动力，拼搏才有方向。坚定理想信念，就要想明白“我是谁、为了谁、依靠谁”，就要弄清楚“为谁干、干什么、怎么干”。唯此，才能在深化改革的复杂形势中不迷航，在艰巨斗争中不退缩，在攻坚克难中把党和人民的事业推向新境界。';
  static const Map<String,dynamic>ques1={
    "isChoice": true,
    "question": '七一勋章”获得者都来自人民、植根人民，是立足本职、默默奉献的平凡英雄。他们的事迹可学可做，他们的精神可追可及，以下“七一勋章”获得者与其先进事迹表述对应正确的是：',
    "quesId": 1,
    "options": ['张桂梅——坚持志愿服务十余载 群众心中的“活雷锋”','王兰花——点亮贫困山区女孩梦想的“校长妈妈”','孙景坤——公而忘私 永葆革命本色的战斗功臣', '李宏塔——为国守海寸步不让 带领群众共同致富'],
    "answerIndex": 2
  };
  static const Map<String,dynamic>ques2={
    "isChoice": false,
    "quesId": 2,
    "options": null,
    "answerIndex": null,
    "question": '''
材料二

“大家以前对窑洞有些什么印象？”开窑村的村委委员小辛问。
“习近平总书记在给全国人民的新年贺词中，提到了当年毛主席与黄炎培先生的‘窑洞对’。如何跳出治乱兴衰的历史周期率？毛主席给出了第一个答案，让人民来监督政府。现在我们党给出第二个答案，自我革命。在党的二十大报告中，也再次提到这一重要论断。‘窑洞对’，是我对窑洞最深刻的印象。”
“提到窑洞，脑海中浮现的画面就是黄土地、高山坡，挖个洞在里面住着，想到就觉得特别艰苦。”
“窑洞已有4000多年的历史，它不仅是我们祖祖辈辈的栖身之地，也曾是红军的驻地……”小辛向游客娓娓讲述有关窑洞的悠久历史和红色岁月。前来参观的游客们纷纷谈起自己的感受，来到黄河岸边、大山深处，面对着300孔隐在群山中层层叠叠错落有致的窑洞，即使现如今这里已经被改造成文化教育基地，游客们依然能想象出革命战争年代窑洞中的艰苦景象。
参观行程过半，有位游客问小辛：“你们当时是怎么想起把这些窑洞打造成文化教育基地的？”
小辛说：“经济条件好了，我们也陆续住进新盖的房子，大部分窑洞被废弃。但是我们内心非常不愿意窑洞就这么消失。因为我们世世代代都曾经居住在窑洞里，窑洞对于我们来说，是血脉，也是乡愁。”
小辛想到了7年前，那时候村委会正打算让这些“沉睡的资产”焕发出新的生机。村委会找到了某大学建筑学院的顾教授团队负责窑洞修复项目。顾教授团队和村委会多次协商，反复讨论，最终达成一致意见：修复窑洞要尽量保留自然地貌，以及窑洞和院落的本来面貌。因此，修复工程使用的建筑材料都是废弃的砖瓦、石头、旧门窗、破碎的缸罐等。
小辛还记得，当时他在读大学，回家看望父母时，村民们找到他，说他有文化，让他代表村民们去和顾教授沟通。“小辛啊，你看，这些旧材料是挺省钱的，但是费时费工啊，我们啥时候能修好呢？而且修好了，这不和以前一个样吗？还是灰蒙蒙的。修就修得好看一点嘛！”
面对村民们的不理解，小辛主动找到村委会工作人员，还邀请了一些村民代表，协商共议后，在村里举办了“发现砖石之美”影像展。这让村民们重新认识到窑洞建筑的历史价值，也更加认同窑洞原本的建筑风格。“这是我们永恒的记忆符号，也是独特的文化标识。废旧材料本身就凝结着村庄的历史与个体的记忆，是新的建筑材料无法替代的。”小辛说。
村民们从否定变成了支持，开始踊跃捐献家中的旧建材。不少人主动问：“我们家里就有很多旧砖旧瓦啊，你们施工还要不要？”村里的王大娘早年丧夫，曾经过得很艰辛。生活好转离开窑洞老屋时，她爬上屋顶将瓦小心地逐片剥落，并保存了30多年。她找到顾教授，把这些瓦都捐了出来，说：“现在日子好了，没想到这些旧瓦片还能再派上用场，捐给你们比搁我手里强！”
施工期间，小辛组织村民们去工地观看。“这里是我捐出的砖。”“这个角落里的图案，有我家孩子拿来的玻璃球。”“这里可以用碎瓦片砌成‘花墙’。”村民们饶有兴趣地指指点点，还不时出谋划策。小辛还带领村民们发起了多次义务劳动，上山采石、填坑铺地、为工地运送物资、向工匠师傅嘘寒问暖，以实际行动支持窑洞修复项目。
村民的“言”和“行”慢慢渗透进修复窑洞的师傅们心里，他们也不再着急赶工，开始思考怎么能更好地把顾教授团队的方案、村民们的灵感和他们的手艺融合起来。老郑，这个从业30余年的工匠师傅说：“刚来时，一看在深山里，心里嘀咕这次肯定特别苦。但是施工过程中，通过和顾教授他们接触，和开窑村的村民闲聊，我才知道原来窑洞还有这么多说法，窑洞文化的历史这么悠久。一下子就让我们这些泥土匠的活有了意义！再苦心也甜！”
窑洞修复项目的结束，意味着文化教育基地新的工作的开始。恰逢小辛大学毕业，他被村里留下，担任村委委员，开始承担文化教育基地的宣传推广工作。一些村民也成为了义务宣讲员，他们每每谈起村里的窑洞，都特别骄傲。“当时窑洞修复花了一年多才完成。有村民说，窑洞修复的过程，也是他们从旁观者变成参与者再到传承者的过程。”小辛感慨道。

请你根据“给定资料2”，谈谈为什么“有村民说，窑洞修复的过程，也是他们从旁观者变成参与者再到传承者的过程”。（15分）
要求：分析全面，条理清晰。不超过250字。
    ''',
  };
}